{
  "Unexpected token.": 1,
  "`let \n [` is a restricted production at the start of a statement": 2,
  "Identifier expected": 3,
  "',' expected": 4,
  "Declaration or statement expected": 5,
  "Private identifiers cannot be used as parameters": 6,
  "Catch clause variable cannot have an initializer": 7,
  "Declaration or statement expected. This follows a block of statements so if you intended to write a destructuring assignment you might need to wrap the whole assignment in parentheses": 8,
  "Expression exprected. A compound assignment or an logical assignment cannot follow an array literal": 9,
  "Linebreak ermitted after throw": 10,
  "Identifier expected. 'let' is a reserved word in strict mode": 11,
  "Missing initializer in destructuring declaration": 12,
  "Missing initializer in const declaration": 13,
  "Unary expressions as the left operand of an exponentation expression must be disambiguated with parentheses": 14,
  "Expression expected": 15,
  "Invalid optional chain from new expression": 16,
  "The binding pattern is not destructible": 17,
  "A rest element cannot have an initializer": 18,
  "A rest parameter must be last in a parameter list": 19,
  "Generators can only be declared at the top level or inside a block": 20,
  "Function declarations cannot be used in a single-statement context":21,
  "Class declarations cannot be used in a single-statement context":22,
  "Expression exprected. A compound assignment or an logical assignment cannot follow an object literal": 23,
  "The left-hand side of an assignment expression must be a variable or a property access": 24,
  "The operand of an increment or decrement operator must be a variable or a property access": 25,
  "Block body arrows can not be immediately accessed without a group": 27,
  "An arrow function can not be part of an operator to the right": 28,
  "Block body arrows can not be immediately invoked without a group": 29,
  "Block body arrows can not be immediately tagged without a group": 30,
  "The left hand side of the arrow is not destructible ": 31,
  "Trailing comma not allowed.": 32,
  "A return statement can only be used within a function_body": 33,
  "An member access expression should take an argument.": 34,
  "A rest parameter or binding pattern may not have a trailing comma.": 35,
  "Parameter cannot have question mark and initializer.": 36,
  "An index signature cannot have a rest parameter.": 37,
  "A 'set' accessor must have exactly one parameter.": 38,
  "A 'set' accessor cannot have an optional parameter.": 39,
  "A 'set' accessor parameter cannot have an initializer.": 40,
  "A 'set' accessor cannot have rest parameter.": 41,
  "A 'get' accessor cannot have parameters.": 42,
  "'delete' cannot be called on an identifier in strict mode.": 43,
  "A 'for-await-of' statement is only allowed within an async function or async generator.": 44,
  "A 'continue' statement can only be used within an enclosing iteration statement.": 45,
  "A 'break' statement can only be used within an enclosing iteration or switch statement.": 46,
  "A 'default' clause cannot appear more than once in a 'switch' statement.": 47,
  "A 'yield' expression is only allowed in a generator body.": 48,
  "Only a single variable declaration is allowed in a 'for...of' statement.": 49,
  "Invalid left-hand side: Must have a single binding in a 'for...of' statement.": 50,
  "The variable declaration of a 'for...in or of' statement cannot have an initializer.": 51,
  "The lexical declaration of a 'for...in or of' statement cannot have an initializer.": 52,
  "The body of an 'if' statement cannot be the empty statement.": 53,
  "Dynamic import must have one specifier as an argument.": 54,
  "Specifier of dynamic import cannot be spread element.": 55,
  "Dynamic import cannot have type arguments.": 56,
  "`yield` expression cannot be used in function parameters": 57,
  "`await` expression cannot be used in function parameters": 58,
  "The `import` keyword can only be used with the module goal": 59,
  "The `export` keyword can only be used with the module goal": 60,
  "`=` can only be used in an object literal property inside a destructuring": 61,
  "The left-hand side of a 'for...in' statement must be a variable or a property access.": 62,
  "The left-hand side of a 'for...of' statement must be a variable or a property access.": 63,
  "Method definition expected": 64,
  "Classes may not have a static property named 'prototype'": 65,
  "Multiple constructor implementations are not allowed": 66,
  "Class constructor may not be a accessor": 67,
  "Dot property must be an identifier": 68,
  "Private identifiers are not allowed outside class bodies": 69,
  "Tagged template expressions are not permitted in an optional chain.": 70,
  "An optional chain cannot contain private identifiers.": 71,
  "Import Call should take at least one argument": 72,
  "'super' can only be referenced in members of derived classes or object literal expressions": 73,
  "'super' must be followed by an argument list or member access.": 74,
  "'with' statements are not allowed in strict mode.": 75,
  "Identifier expected. 'yield' is a reserved word in strict mode": 76,
  "Identifier expected. 'await' is a reserved word in module goal": 77,
  "The operand of a 'delete' operator must be a property reference.": 79,
  "'new.target' only allowed within functions": 80,
  "A lexical declaration can't define a 'let' binding": 81,
  "Variable declaration expected.": 82,
  "'await' expressions cannot be used in a parameter initializer": 83,
  "Line terminator not permitted before arrow": 84,
  "'use strict' directive cannot be used with non-simple parameter list.": 85,
  "Escapes \\8 or \\9 are not syntactically valid escapes": 86,
  "Octal escape sequences are not allowed in strict mode": 87,
  "Octal literals are not allowed in strict mode": 88,
  "Invalid hexadecimal escape sequence": 89,
  "Invalid Unicode escape sequence": 90,
  "Coalescing and logical operators used together in the same expression must be disambiguated with parentheses": 91,
  "Unicode codepoint must not be greater than 0x10FFFF": 92,
  "Invalid astral character": 93,
  "Type parameter declaration needs a default, since a preceding type parameter declaration has a default": 94,
  "Explicit inexact syntax cannot appear in class or interface definitions": 95,
  "`declare module` cannot be used inside another `declare module`": 96,
  "A binding pattern parameter cannot be optional in an implementation signature.": 97,
  "A 'set' accessor cannot have a `this` parameter": 98,
  "Spread properties cannot have variance": 99,
  "A type annotation is required for the `this` parameter.": 100,
  "The `this` parameter must be the first function parameter.": 101,
  "`_` is only allowed as a type argument to call or new": 102,
  "Type parameters must come after the async keyword, e.g. instead of `<T> async () => {}`, use `async <T>() => {}`": 103,
  "Only declares and type imports are allowed inside declare module": 104,
  "Class methods cannot have the 'declare' modifier": 105,
  "Initializers are not allowed in fields with the `declare` modifier.": 106,
  "Explicit inexact syntax cannot appear inside an explicit exact object type": 107,
  "The this parameter cannot be optional": 108,
  "Prohibit delete of private class elements": 109,
  "Cannot use new with import(...)": 110,
  "Cannot use 'import.meta' outside a module": 111,
  "for await (... of ...) is only valid in async functions and async generators": 112,
  "Unterminated string literal": 113,
  "Unterminated template literal": 114,
  "Binding identifier expected": 115,
  "Identifier expected. Reserved word in strict mode": 116,
  "A class declaration without the 'default' modifier must have a name.": 117,
  "Invalid character": 118,
  "'#constructor' is a reserved word.": 119,
  "'&&' and '??' operations cannot be mixed without parentheses": 120,
  "Escape sequence in keyword import": 122,
  "The only valid meta property for new is 'new.target": 123,
  "Keywords cannot contain escape characters": 124,
  "'let' is not allowed to be used as a name in 'let' or 'const' declarations.": 125,
  "Duplicate regular expression flag": 126,
  "Unterminated regular expression": 127,
  "Unknown regular expression flag": 128,
  "An identifier or keyword cannot immediately follow a numeric literal": 129,
  "Binary integer literal like sequence containing an invalid digit": 130,
  "Octal integer literal like sequence containing an invalid digit": 131,
  "Multiple consecutive numeric separators are not permitted": 132,
  "Binary integer literal like sequence without any digits": 133,
  "Octal integer literal like sequence without any digits": 134,
  "Hex integer literal like sequence without any digits": 135,
  "Numeric separators are not allowed at the end of numeric literals": 136,
  "Numeric separator can not be used after leading_0": 137,
  "Invalid BigInt syntax": 138,
  "Non number after exponent indicator": 139,
  "Numeric separators not allowed here": 140,
  "Function declarations can only be declared at top level or inside a block in strict mode": 141,
  "'try' expected": 143,
  "'{0}' expected": 144,
  "Did you mean to use a ':'? An '=' can only follow a property name when the containing object literal is part of a destructuring": 145,
  "Unicode escapes at the start of labels should not allow keywords": 146,
  "Duplicate label": 148,
  "Missing label": 149,
  "Lexical declaration expected": 151,
  "An async arrow without the 'default' modifier can not be exported": 152,
  "Async arrow can not be followed by new expression": 153,
  "'{0}' keyword must not contain escaped characters": 154,
  "Property assignment expected": 156,
  "A {0} accessor cannot be a generator": 157,
  "The parser expected to find a '}' to match the '{' token here": 159,
  "Did you forgot a ']' to match the `[` token?": 160,
  "The left-hand side must be a variable or a property access.": 161,
  "The left-hand side of an assignment expression may not be an optional property access": 162,
  "'arguments' can only be used in functions and class methods": 163,
  "Constructor implementation is missing": 164,
  "Expected a ')' to match the '(' token here": 165,
  "'yield' can only be used in a generator function": 166,
  "Cannot use 'yield' as a name on a async generator declaration": 169,
  "Cannot use 'yield' as a name on a generator declaration": 170,
  "'async' keyword in an async arrow must not contain escaped characters": 171,
  "'{0}' cannot be used as an identifier here": 172,
  "'{0}' cannot contain escape characters": 173,
  "Arrow parameters can only contain a binding pattern or an identifier": 175,
  "Property definition expected. Did you mean to use a ':'?": 176,
  "Expected a computed property": 177,
  "Object literal expected": 178,
  "The variable declaration of a 'for...of ... in' statement cannot have an initializer.": 179,
  "'static' modifier already seen": 180,
  "An object literal cannot have multiple properties with the name '__proto__'": 181,
  "Object property expected": 182,
  "Cannot assign to 'eval' and 'arguments' because they are not a variable": 183,
  "'arguments' is only allowed in functions and class methods": 184,
  "BindingIdentifier may not be `await` within class static blocks": 185,
  "A 'static {}' initialization block may not have decorator": 186,
  "Cannot redeclare block-scoped variable '{0}'": 187,
  "Cannot bound an already bound catch clause binding": 188,
  "A block-scoped variable cannot shadow a catch clause binding": 189,
  "A rest element must be last in a destructuring pattern": 190,
  "Duplicate bindingidentifier '{0}'": 191,
  "A formal parameter cannot be bound multiple times in the same parameter list": 192,
  "Duplicate arrow formal parameter": 193,
  "An implementation cannot be declared in ambient contexts": 194,
  "The left-hand side of a for...of loop cannot contain an 'async' identifier": 195,
  "Expected '=>'": 196,
  "Missing an opening brace - '{": 197,
  "Missing an opening parentheses - '(": 198,
  "Missing an opening bracket - '[": 199,
  "Expected to find a '>' to match the '<' token here.": 200,
  "Type expected": 201,
  "Expected a valid subtraction operand": 202,
  "The 'declare' modifier cannot follow after a 'static' modifier": 203,
  "Decorators cannot follow after a 'static' modifier": 204,
  "Decorators are not valid here": 205,
  "'import.meta' is the only valid meta property for import": 206,
  "The left-hand side of a 'for...in or of' statement must not be an arrow function": 207,
  "Cannot use the 'yield' keyword on the left-hand side of a 'for...in' statement in a generator context": 208,
  "Cannot use 'await' as a name on a async generator expression": 209,
  "Cannot use 'await' as a name on a async function expression": 210,
  "Cannot use 'await' as a name on a async generator declaration": 211,
  "Cannot use 'await' as a name on a async function declaration": 212,
  "Line terminator not permitted before async modifier in a class body": 213,
  "'async' modifier cannot be used here": 214,
  "Parameter 'await' for async arrow not allowed here": 215,
  "Function declarations inside if statements cannot be used in strict mode": 216,
  "Without web compability enabled functtion declarations are disallowed inside if statements": 218,
  "Cannot use 'yield' as a name on a generator function expression": 219,
  "'await' is only allowed within async functions and at the top levels of modules": 220,
  "Identifier expected. 'yield' is a reserved word in strict mode and cannot be used as an label": 222,
  "Identifier expected. 'await' is a reserved word in strict mode and module goal and cannot be used as an label": 223,
  "'#!' can only be used at the start of a file.":224,
  "Private identifier cannot contain escape characters": 225,
  "Private fields can't be accessed on super ": 226,
  "An optional parameter cannot be used within an array pattern": 227,
  "Catch clause variable cannot have an type annotation": 228,
  "The 'this' keyword cannot be a formal parameter": 229,
  "A '{0}' accessor cannot have a `this` parameter": 231,
  "Import declaration expected": 234,
  "Identifier expected. A decorator name can only be an identifier": 235,
  "A 'break' statement can only jump to a label of an enclosing statement": 236,
  "A 'continue' statement can only jump to a label of an enclosing iteration statement.": 237,
  "The left-hand side of a for-of loop cannot start with 'let'": 238,
  "An async function declaration is not allowed as `if-else` child": 239,
  "Octal escape sequences are not allowed in template literal": 240,
  "Octal literals are not allowed in template literal": 241,
  "Comma operator is disallowed as an async arrow concise body with `export default` modifier": 242,
  "`MethodDefinition` expected": 243,
  "A class field cannot have a field named 'constructor'": 244,
  "Class fields may not have a static property named 'prototype'": 245,
  "Cannot use the 'yield' keyword on the left-hand side of conditional expression in a generator context": 246,
  "An optional parameter cannot be used without an ':' in an arrow function type parameter list": 247,
  "An index signature parameter cannot have a question mark.": 248,
  "An TypeAlias declaration require a '='": 249,
  "Await expression cannot be used inside class static block.": 250,
  "'For await' loops cannot be used inside class static block.": 251,
  "A 'return' statement cannot be used inside class static block.": 252,
  "A 'static {}' initialization block cannot have the 'static' modifier": 253,
  "Variable declaration not allowed at this location": 255,
  "'finally' expected": 256,
  "'catch' expected": 257,
  "'{0}' is not allowed here. Did you mean '{1}'?": 258,
  "HTML comments can only be used in script mode": 259,
  "HTML comments can only be used with web compatibility enabled": 260,
  "Did you mean 'async function foo() {}'? An 'async' modifier can only follow a function declaration in this context": 261,
  "'{0}' statements must be braced": 262,
  "Parentheses are prohibited around the parameter in this single parameter arrow function": 263,
  "Unexpected 'debugger' statement": 264,
  "Forbidden bitwise operation": 265,
  "Type declaration of 'any' loses type-safety. Consider replacing it with a more precise type": 266,
  "Use a for...of statement instead of for...in. If iterating over an object, use Object.keys() to access its enumerable keys.": 267,
  "Unexpected var, use let or const instead": 268,
  "Do not use comma operator here because it can be easily misunderstood or lead to unintended bugs": 269,
  "Empty logic blocks usually result from incomplete refactoring.": 270,
  "Do not nest ternary expressions": 271,
  "'{0}' is never used": 272,
  "Unexpected comma in middle of array": 273,
  "Expected a default case": 274,
  "Unsafe usage of '{0}'": 275,
  "'eval' can be harmful": 276,
  "Unexpected console statement": 277,
  "Access to arguments.callee is forbidden": 278,
  "'{0}' statements in finally blocks are forbidden.": 279,
  "Array has a missing element": 280,
  "Object literal keys that are strings or numbers must be a method or have a colon": 281,
  "Computed property must be followed by a colon": 282,
  "Use 'while' loops instead of 'for' loops.": 283,
  "Private names are only allowed in property accesses or in `in` expressions": 284
  }
